In [1]:
import numpy as np
import pandas as pd

In [2]:
data = {'a':[1,2,3,4],
        'b':(5,6,7,8),
        'c':np.arange(9,13)}
#构造dataframe
frame = pd.DataFrame(data)
frame

   a  b   c
0  1  5   9
1  2  6  10
2  3  7  11
3  4  8  12

In [3]:
#index属性查看行索引
frame.index

RangeIndex(start=0, stop=4, step=1)

In [4]:
frame.columns

Index(['a', 'b', 'c'], dtype='object')

In [5]:
frame.values

array([[ 1,  5,  9],
       [ 2,  6, 10],
       [ 3,  7, 11],
       [ 4,  8, 12]], dtype=int64)

In [6]:
#指定index
frame = pd.DataFrame(data,index=['A','B','C','D'],columns=['a','b','c','d'])
frame

   a  b   c    d
A  1  5   9  NaN
B  2  6  10  NaN
C  3  7  11  NaN
D  4  8  12  NaN

In [7]:
pd1 = pd.DataFrame({'a':pd.Series(np.arange(3)),
                    'b':pd.Series(np.arange(3,6))})
pd1

   a  b
0  0  3
1  1  4
2  2  5

In [8]:
#构造二维数组对象
arr1 = np.arange(12).reshape(4,3)
print(arr1)
frame1 = pd.DataFrame(arr1)
frame1

[[ 0  1  2]
 [ 3  4  5]
 [ 6  7  8]
 [ 9 10 11]]

   0   1   2
0  0   1   2
1  3   4   5
2  6   7   8
3  9  10  11

In [9]:
l2 = [pd.Series(np.random.rand(3)),pd.Series(np.random.rand(2))]
print(l2)
pd4 = pd.DataFrame(l2)
pd4

[0    0.888762
1    0.602112
2    0.411755
dtype: float64, 0    0.093917
1    0.997047
dtype: float64]

          0         1         2
0  0.888762  0.602112  0.411755
1  0.093917  0.997047       NaN

In [10]:
pd5 = pd.DataFrame(np.arange(9).reshape(3,3),index=['A','B','C'],columns=['a','b','c'])
print(pd5)
pd5.T

   a  b  c
A  0  1  2
B  3  4  5
C  6  7  8

   A  B  C
a  0  3  6
b  1  4  7
c  2  5  8

In [14]:
pd5['d']=9
pd5['e']=[1,2,3]
pd5

   a  b  c  d  e
A  0  1  2  9  1
B  3  4  5  9  2
C  6  7  8  9  3

In [15]:
del(pd5['d'])
pd5

   a  b  c  e
A  0  1  2  1
B  3  4  5  2
C  6  7  8  3